package JAVA;

public class L28 {

	public static void main(String[] args) {

/*
-바이트 코드 파일 : 자바 소스 파일을 javac 명령어로 컴파일한 파일을 말합니다.
-JVM : 자바 가상 기계는 바이트 코드 파일을 운영체제를 위한 완전한 기계어로 번역하고 실행하는 역할을 합니다.
	   JVM은 java 명령어에 의해 구동됩니다.
-클래스 선언 : 자바 소스 파일은 클래스 선언부와 클래스 블록으로 구성됩니다ㅣ 이렇게 작성하는 것을 클래스 선언이라고 합니다.
-main() 메소드 : java 명령어로 바이트 코드 파일을 실행하면 먼저 main()메소드를 찾아 블록 내부를 실행합니다.
				 그래서 main()메소드를 프로그램 실행 진입점이라고 부릅니다.
-주석 : 주석은 프로그램 실행과는 상관없이 코드에 설명을 붙인 것을 말합니다. 주석은 컴파일 과정에서 무시되고 실행문만 바이트 코드로 번역되빈다.
-실행문 : 변수 선언, 값 저장, 메소드 호출에 해당하는 코드를 말합니다. 실행문 끝에는 세미콜론(;)을 붙여야 합니다.
*/
	}
}