package JAVA;

public class L32 {

	public static void main(String[] args) {

/*
-소스 : 고급 언어로 작성된 내용
-소스 파일 : 프로그래밍 언어로 작성한 파일
-자바는 객체 지향 프로그래밍이다
-객체 지향 프로그래밍(OPP) : 프로그램을 개발하는 기법으로, 부품에 해당하는 객체들을 먼저 만들고 이것들을 하나씩 조립 및 연결해서 전체 프로그램을 완성하는 기법
-기계어 : 컴퓨터(운영체제)가 이해하고 실행할 수 있는 0과 1로 이루어진 코드를 말한다
-프로그래밍 언어 : 사람이 기계어를 이해하는 것은 매우 어렵기 때문에 사람의 언어와 기계어의 다리 역할을 한다. 종류로는 C, C++, 자바, 파이썬 등이 있다.
-소스 파일 : 프로그래밍 언어로 작성된 파일을 말한다
-컴파일 : 소스 파일을 기계어로 번역하는 것을 말한다. 이 역할을 담당하는 소프트웨어를 컴파일러라고 한다.
		  컴퓨터가 이해할 수 있도록 0과 1로 이루어진 기계어로 변환하는 과정
-JDK : 자바 개발 도구의 줄임말로, 자바로 프로그램을 개발할 수 있는 실행환경(JVM)과 개발 도구(컴파일러)등을 제공한다
-환경 변수 : 운영체제가 실행하는 데 필요한 정보를 제공해주는 변수를 말한다. JDK를 설치한 후 명령 라인(명령 프롬프트, 터미널)에서 컴파일(javac)와 실행(java)
			 명령어를 사용하려면 JAVA_HOME 환경 변수를 등록하고 Path 환경 변수를 수정하는 것이 좋다.
-자바 언어로 프로그램을 개발하기 위해서는 JDK를 설치해야 한다
-JDK가 설치되면 기본적으로 C:\Program Files\java 폴더가 생성된다
-자바 컴파일러와 실행 명령어는 JDK 설치 폴더 \bin 폴더에 있다
-JDK 설치 폴더 안의 bin 폴더를 Path 환경 변수에 등록하는 이유는 다른 경로에서 bin 폴더 안에 있는 명령어를 사용할 수 있도록 하기 위해서다
*/
	}
}