package JAVA;

public class L36 {
	
/*
-변수 : 값을 저장할 수 있는 메모리 번지에 붙인 이름입니다. 변수를 통해 프로그램은 메모리 번지에 값을 저장하고 읽을 수 있습니다.
-로컬 변수(지역 변수) : 메소드 블록 내에서 선언된 변수. 로컬 변수는 메소드 실행이 끝나면 메모리에서 자동으로 없어진다.
-변수 선언 : 변수에 어떤 타입의 데이터를 저장할지 그리고 변수 이름이 무엇인지를 결정하는 것을 말합니다.
-할당 : 변수에 값을 넣거나 저장하는 것을 '할당한다'고 한다.
-참조 : 변수에 접근하는 것을 '참조한다'고 한다.
-변수 사용 : 변수의 값을 읽거나 변경하는 것을 말합니다. 변수는 출력문이나 연산식 내부에서 사용되어 변수에 저장된 값을 출력하거나 연산에 사용합니다.
-변수 사용 범위 : 변수는 자신이 선언된 위치에서 자신이 속한 블록 내부까지만 사용이 가능하고 밖에서는 사용할 수 없습니다.
*/

/*
-예약어 : 이미 해당 프로그래밍 언어에서 사용하기 위해 의미가 정해져 있는 것
-초기값 : 변수를 선언하고 처음 저장하는 값
-초기화 : 변수에 초기값을 주는 행위
-리터럴 : 소스 코드 내에서 직접 입력된 값
-정수 타입 : 정수를 저장할 수 있는 타입으로 byte, short, int, long 타입을 말합니다
-char 타입 : 작은따옴표(')로 감싼 하나의 문자 리터럴을 저장할 수 있는 타입입니다.
-String 타입 : 큰따옴표(")로 감싼 문자열을 저장할 수 있는 타입입니다.
-실수 타입 : 실수를 저장할 수 있는 타입으로 float, double 타입을 말합니다.
-boolean 타입 : 참과 거짓을 의미하는 true와 false를 저장할 수 있는 타입입니다.
*/
	
/*
※이스케이프 문자
\t : 수평 탭
\n : 줄 바꿈
\r : 캐리지 리턴
\" : "(큰 따옴표)
\' : '(작은 따옴표)
\\ : \
\u16진수 : 16진수에 해당하는 유니코드 	 
*/
	
}
