package JAVA;

public class L60 {

	public static void main(String[] args) {
		
		System.out.println("[형식 문자열]");
		
		/*
		정수
		%6d : 정수									123
		%6d : 6자리 정수, 왼쪽 빈 자리 공백			___123
		%--6d : 6자리 정수, 오른쪽 빈 자리 공백		123___
		%06d : 6자리 정수, 왼쪽 빈 자리 0 채움		000123
		
		실수
		%10.2f : 소수점 이상 7자리, 소수점 이하 2자리, 왼쪽 빈 자리 공백		____123.45
		%-10.2f : 소수점 이상 7자리, 소수점 이하 2자리, 오른쪽 빈 자리 공백		123.45____
		%010.2f : 소수점 이상 7자리, 소수점 이하 2자리, 왼쪽 빈 자리 0 채움		0000123.45
		
		문자열
		%s : 문자열									abc
		%6s : 6자리 문자열, 왼쪽 빈 자리 공백		___abc
		%-6s : 6자리 문자열, 오른쪽 빈 자리 공백	abc___
		
		특수문자
		\t : 탭(tab)
		\n : 줄 바꿈
		%% : %					%
		*/
		
		
	}
}